a = int(input("Введите длину первой фигуры"))
b = int(input("Введите ширину первой фигуры"))
h = int(input("Введите ширину первой фигуры"))
z =int(input("Введите длину второй фигуры"))
x =int(input("Введите ширину второй фигуры"))
c =int(input("Введите ширину второй фигуры"))
q = int(input("Введите длину третьей фигуры"))
w =int(input("Введите ширину третьей фигуры"))
e =int(input("Введите высоту третьей фигуры"))

d = a*b*h
t =z*x*c
n = q*w*e
g = d+t+n
print("Средний объем трех фигур",g//3)











